/*********************************************************************************************************
* 模块名称: ColorStatic.cpp
* 摘    要: 颜色定义
* 当前版本: 1.0.0
* 作    者: Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期: 2021年01月22日
* 内    容:
* 注    意:
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "pch.h"
#include "ColorStatic.h"

/*********************************************************************************************************
* 函数名称: CColorStatic
* 函数功能: 构造函数
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
CColorStatic::CColorStatic()
{
	mBkColor = ::GetSysColor(COLOR_3DFACE); //将背景颜色初始化为系统默认的颜色。
	mTextColor = BLACK;                     //将文本内容初始化为黑色
	mBkgnd.CreateSolidBrush(mBkColor);      //为背景创建画笔颜色。

	mUseSysFont = true;
	mHCentered = false;
	mVCentered = false;
}

/*********************************************************************************************************
* 函数名称: ~CColorStatic
* 函数功能: 析构函数
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
CColorStatic::~CColorStatic()
{

}

BEGIN_MESSAGE_MAP(CColorStatic, CStatic)
	ON_WM_CTLCOLOR_REFLECT()
END_MESSAGE_MAP()

/*********************************************************************************************************
* 函数名称: CtlColor
* 函数功能: 设置对话框文本背景颜色
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
HBRUSH CColorStatic::CtlColor(CDC* pDC, UINT nCtlColor)
{
	HBRUSH hbr;
	hbr = (HBRUSH)mBkgnd;           //给画笔传递句柄
	pDC->SetBkColor(mBkColor);      //将文本背景的颜色设置为对话框传递的颜色
	pDC->SetTextColor(mTextColor);  //将文本颜色设置为对话框传递的文本颜色

	UNREFERENCED_PARAMETER(nCtlColor);

	return hbr;
}

/*********************************************************************************************************
* 函数名称: SetBkColor
* 函数功能: 设置对话框背景颜色
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
void CColorStatic::SetBkColor(COLORREF crColor)
{
	mBkColor = crColor;                //将对话框传递的值传递给背景颜色的成员变量
	mBkgnd.DeleteObject();             //删除所有之前画笔颜色（如果有的话）。
	mBkgnd.CreateSolidBrush(crColor);  //为静态文本背景创建画笔颜色
	RedrawWindow();
}

/*********************************************************************************************************
* 函数名称: SetTextColor
* 函数功能: 设置文本颜色
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
void CColorStatic::SetTextColor(COLORREF crColor)
{
	mTextColor = crColor;             //将对话框传递的值传递给文本颜色的成员变量
	RedrawWindow();
}

/*********************************************************************************************************
* 函数名称: SetTextFont
* 函数功能: 设置字体
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
void CColorStatic::SetTextFont(LOGFONT* lf)
{
	mFont.CreateFontIndirect(lf);
	mUseSysFont = false;

	Invalidate();
}

/*********************************************************************************************************
* 函数名称: VCenterText
* 函数功能: 文字在V中心。
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
void CColorStatic::VCenterText()
{
	mVCentered = true;

	Invalidate();
}

/*********************************************************************************************************
* 函数名称: HCenterText
* 函数功能: 文字在H中心。
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
void CColorStatic::HCenterText()
{
	mHCentered = true;

	Invalidate();
}

/*********************************************************************************************************
* 函数名称: SetColor
* 函数功能: 设置文本背景和字体颜色
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期: 2021年01月22日
* 注    意:
*********************************************************************************************************/
void CColorStatic::SetColor(COLORREF color)
{
	SetTextColor(color);
	SetBkColor(RGB(0, 0, 0));
}
